### Key Steps for the Project

Feel free to be creative with your solutions, but do follow the CRISP-DM process in finding your solutions.

- Begin the project by conducting an exploratory data analysis. Common forms of exploratory data analysis include generating distribution plots to understand the skewedness of different variables or generating histograms to understand how data is distributed. Alternatively, some data scientists like to perform principal component analyses to better understand the underlying structure of the data.


**ابدأ المشروع بإجراء تحليل استكشافي للبيانات. تشمل الأشكال الشائعة لهذا التحليل إنشاء مخططات التوزيع لفهم مدى انحراف المتغيرات المختلفة، أو إنشاء المدرجات التكرارية لفهم كيفية توزيع البيانات. بدلاً من ذلك، يفضل بعض علماء البيانات إجراء تحليل المكونات الرئيسية لفهم البنية الأساسية للبيانات بشكل أفضل.**



- Next, summarize the findings of your exploration. Explain whether the data needs to be cleaned based on your findings. If it does, perform the data cleaning. If not, move on with selecting the type of machine learning model that is appropriate for predicting from your data.


**بعد ذلك، لخص نتائج بحثك. اشرح ما إذا كانت البيانات بحاجة إلى تنظيف بناءً على نتائجك. إذا كانت كذلك، فقم بتنظيف البيانات. وإذا لم تكن كذلك، فانتقل إلى اختيار نوع نموذج التعلم الآلي المناسب للتنبؤ باستخدام بياناتك.**


- Train the machine learning model on your data. Evaluate the model for overall accuracy, recall, and other evaluation scores. Explain what the measures tell us about the model and how it works.

**قم بتدريب نموذج التعلم الآلي على بياناتك. قيّم النموذج من حيث الدقة الإجمالية، والاستدعاء، ودرجات التقييم الأخرى. اشرح ما تخبرنا به هذه المقاييس عن النموذج وكيفية عمله.**


- Imagine a new scenario that requires a prediction from your model to answer. Describe the scenario in your post and run a prediction from the model. Explain the meaning of this prediction and what it tells a reader.


**تخيل سيناريو جديدًا يتطلب تنبؤًا من نموذجك للإجابة عليه. صف هذا السيناريو في منشورك، ثم قم بتشغيل النموذج للتنبؤ. اشرح معنى هذا التنبؤ وما الذي يُخبر به القارئ.**


<br>

    
</br>

## Project Deliverables
There are two deliverables that are required for project completion.

A Github repository for your code.<br>
A blog post of your findings.

### Your Github repository must have the following contents:

- A **README.md** file that communicates the libraries used, the motivation for the project, the files in the repository with a small description of each, a summary of the results of the analysis, and necessary acknowledgments.
- Your **code** in a Jupyter notebook, with appropriate comments, analysis, and documentation.
- You may also provide any other necessary **documentation** you find necessary.
- For the **blog post**, pick a platform of your own choice. For example, it can be on your website, a Medium post (Josh's sample report(opens in a new tab) on How Do YOU Become A Developer?), or a Github blog post.

**Your blog must provide the following:**

- A clear and engaging title and image.
- Your questions of interest.
- Your findings for those questions with a supporting statistic(s), table, or visual.
#### Note: The post should not dive into technical details or difficulties of the analysis; this should be saved for Github. The post should be understandable for non-technical people from many fields.

<br>


<br/>

## Economic and Business Data: United States of America Business Formation Statistics
Business formation statistics - US Census Bureau(opens in a new tab)

The United States of America is the world's leading economy and uses bureaucratic staff to manage its economic activities. One of these organizations, the Census Bureau of the United States, compiles statistics on new business formation within the country to understand the flow of economic activity.



بيانات اقتصادية وتجارية: إحصاءات تأسيس الشركات في الولايات المتحدة الأمريكية
إحصاءات تأسيس الشركات - مكتب الإحصاء الأمريكي (يفتح في علامة تبويب جديدة)

تُعدّ الولايات المتحدة الأمريكية الاقتصاد الرائد عالميًا، وتعتمد على كوادر إدارية لإدارة أنشطتها الاقتصادية. ومن بين هذه الجهات، مكتب الإحصاء الأمريكي، الذي يُعنى بجمع إحصاءات حول تأسيس الشركات الجديدة داخل البلاد لفهم حركة النشاط الاقتصادي.

<br>


<br/>

## Exploring

In [6]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [5]:
from sklearn.linear_model import LinearRegression

from sklearn.metrics import root_mean_squared_error

from sklearn.model_selection import train_test_split

from sklearn.dummy import DummyRegressor

## Data Monthly

In [2]:
# get data Monthly

df_monthly =pd.read_csv('bfs_monthly.csv')
df_m_data =pd.read_csv('month_date_table.csv')

NameError: name 'pd' is not defined

In [4]:
# read

df_monthly.head()

,sa,naics_sector,series,geo,year,jan,feb,mar,apr,may,jun,jul,aug,sep,oct,nov,dec
0,U,TOTAL,BA_BA,US,2025,497030,440230,497911,583054,425867,428742,513785,428937,445513,538984,426289,NaN
1,U,NAICS11,BA_BA,US,2025,5141,4258,4398,4679,3128,3041,3539,3019,2884,3222,2686,NaN
2,U,NAICS21,BA_BA,US,2025,547,472,511,575,407,416,497,420,470,516,455,NaN
3,U,NAICS22,BA_BA,US,2025,689,663,697,789,594,595,684,663,572,647,572,NaN
4,U,NAICS23,BA_BA,US,2025,49525,44621,47136,56485,40657,39051,45141,38607,37052,45203,33700,NaN

In [5]:
# read

df_m_data.head()

   Year  Month  Start date    End date        Included Weeks
0  2004      7    7/4/2004   7/31/2004      [27, 28, 29, 30]
1  2004      8    8/1/2004   8/28/2004      [31, 32, 33, 34]
2  2004      9   8/29/2004   9/25/2004      [35, 36, 37, 38]
3  2004     10   9/26/2004  10/30/2004  [39, 40, 41, 42, 43]
4  2004     11  10/31/2004  11/27/2004      [44, 45, 46, 47]

## Data Weekly

In [6]:
# get data weekly

df_us_weekly =pd.read_csv('bfs_us_apps_weekly_nsa.csv')
df_reg_weekly  =pd.read_csv('bfs_region_apps_weekly_nsa.csv')
df_sta_weekly =pd.read_csv('bfs_state_apps_weekly_nsa.csv')
df_w_data =pd.read_csv('date_table.csv')

In [7]:
# read


df_us_weekly.head()

,Year,Week,BA_NSA,HBA_NSA,WBA_NSA,CBA_NSA,YY_BA_NSA,YY_HBA_NSA,YY_WBA_NSA,YY_CBA_NSA
0,2006,1,39580,22590,14960,12800,NaN,NaN,NaN,NaN
1,2006,2,36920,23160,15840,14420,NaN,NaN,NaN,NaN
2,2006,3,63300,37470,24480,21730,NaN,NaN,NaN,NaN
3,2006,4,51910,30740,20270,17270,NaN,NaN,NaN,NaN
4,2006,5,61430,35700,22820,19950,NaN,NaN,NaN,NaN

In [8]:
# read


df_reg_weekly.head()

,Year,Week,Region,Fregion,BA_NSA,HBA_NSA,WBA_NSA,CBA_NSA,YY_BA_NSA,YY_HBA_NSA,YY_WBA_NSA,YY_CBA_NSA
0,2006,1,NE,1,6760,3740,2270,2090,NaN,NaN,NaN,NaN
1,2006,2,NE,1,6280,3810,2360,2320,NaN,NaN,NaN,NaN
2,2006,3,NE,1,11190,6320,3680,3690,NaN,NaN,NaN,NaN
3,2006,4,NE,1,8820,4960,2870,2880,NaN,NaN,NaN,NaN
4,2006,5,NE,1,10710,5980,3470,3400,NaN,NaN,NaN,NaN

In [9]:
# read


df_sta_weekly.head()

,Year,Week,State,BA_NSA,HBA_NSA,WBA_NSA,CBA_NSA,YY_BA_NSA,YY_HBA_NSA,YY_WBA_NSA,YY_CBA_NSA
0,2006,1,AK,90,60,50,30,NaN,NaN,NaN,NaN
1,2006,2,AK,90,50,40,30,NaN,NaN,NaN,NaN
2,2006,3,AK,130,90,70,40,NaN,NaN,NaN,NaN
3,2006,4,AK,100,60,40,20,NaN,NaN,NaN,NaN
4,2006,5,AK,150,80,60,30,NaN,NaN,NaN,NaN

In [10]:
# read


df_w_data.head()

   Year  Week Start date   End date
0  2006     1   1/1/2006   1/7/2006
1  2006     2   1/8/2006  1/14/2006
2  2006     3  1/15/2006  1/21/2006
3  2006     4  1/22/2006  1/28/2006
4  2006     5  1/29/2006   2/4/2006

## Data Annual

In [11]:
# get data ia apps annual

df_ia_annual =pd.read_csv('bfs_ia_apps_annual.csv')

In [12]:
# read


df_ia_annual.head()

   year  fstate state  BA_NSA  HBA_NSA  WBA_NSA  CBA_NSA
0  2005      60    AS     164       67       61       25
1  2006      60    AS     136       70       57       35
2  2007      60    AS     179       90       74       46
3  2008      60    AS     202       78       52       27
4  2009      60    AS     286       96       61       34

## Data County Annual

In [13]:
# get data county apps annual

#df_county_annual =pd.read_csv('bfs_county_apps_annual.xlsx')

df_county_annual = pd.read_excel('bfs_county_apps_annual.xlsx', 'County Data', index_col=None)
df_county_annual.to_csv('bfs_county_apps_annual.csv', encoding='utf-8', index=False)

In [14]:
# read


df_county_annual.head()

,County Level Business Applications,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 15,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Unnamed: 21,Unnamed: 22,Unnamed: 23,Unnamed: 24
0,The Census Bureau has reviewed the annual coun...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,State,County,County Code,state_fips,county_fips,BA2005,BA2006,BA2007,BA2008,BA2009,...,BA2015,BA2016,BA2017,BA2018,BA2019,BA2020,BA2021,BA2022,BA2023,BA2024
2,AL,Autauga County,01001,01,001,335,348,348,367,288,...,291,294,313,384,394,559,776,703,722,626
3,AL,Baldwin County,01003,01,003,1986,2101,1975,1721,1505,...,1735,1858,2114,2104,2317,2697,3407,3674,3856,3631
4,AL,Barbour County,01005,01,005,138,179,156,139,133,...,129,122,114,113,135,230,334,259,418,266

## Insight 1